# -*- coding: utf-8 -*-

import pandas as pd
import pytest


@pytest.fixture
def sample_transactions() -> pd.DataFrame:
    data = {
        "Номер карты": ["1234567812345678", "1234567812345678", "8765432187654321", "8765432187654321"],
        "Сумма платежа": [-1000, -2000, -1500, 3000],
    }
    return pd.DataFrame(data)


@pytest.fixture
def transactions_list() -> pd.DataFrame:
    """Фикстура для создания тестового набора транзакций."""
    data = {
        "Дата операции": [
            "01.10.2023 12:00:00",
            "15.10.2023 15:30:00",
            "21.11.2023 10:00:00",
            "05.12.2023 09:15:00",
            "25.10.2023 11:00:00",
        ],
        "Сумма": [100, 200, 300, 400, 500],
        "Описание": ["Транзакция 1", "Транзакция 2", "Транзакция 3", "Транзакция 4", "Транзакция 5"],
    }
    return pd.DataFrame(data)


@pytest.fixture
def samp_transactions() -> list[dict]:
    return [
        {"Дата операции": "01.01.2023 12:00:00", "Категория": "Еда", "Сумма": 100},
        {"Дата операции": "15.02.2023 12:00:00", "Категория": "Транспорт", "Сумма": 50},
        {"Дата операции": "10.03.2023 12:00:00", "Категория": "Еда", "Сумма": 200},
        {"Дата операции": "20.04.2023 12:00:00", "Категория": "Еда", "Сумма": 300},
    ]
